Repository: u4i-admin/Nahoft-iOS
Catalog: Nahoft/*.lproj/Localizable.strings
Languages: fa

source: To manually send an encrypted text, you need to follow these steps: 1. Exchange public keys with your desired friend beforehand. 2. Go to your friend's chat page and, at the bottom of the page, write your message in the "type your message" section, similar to any other messaging platform…
fa: برای ارسال دستی متن رمزنگاری شده، این شرط باید رعایت شود: شما قبلا کلیدهای عمومی خود را با دوست مورد نظرتان رد و بدل کرده‌اید. به صفحه‌ی چت دوست مورد نظر خود بروید و در پایین صفحه در بخش "پیام خود را بنویس" مانند هر پیام رسان دیگری پیام را بنویسید…

source: To send an encrypted photo manually, you need to follow these two conditions: Condition 1: You know who you want to send the photo to and have previously exchanged public keys. Condition 2: You send the photo as a file to your friend. For example, if you are using Telegram to send the photo, you should send it as a file and not directly from your phone's gallery. This is because Telegram reduces the size of photos, and it won't be possible to decrypt such a photo. However, if you send the photo as a file, Telegram won't make any changes to the photo, and it can be decrypted. Assuming you have met the above two conditions, go to the chat page of the person you want to send the encrypted message to. On the bottom left side of the page, click on camera icon. After clicking, two new icons will appear. Download icon is for when you want to hide your message in a photo and save the photo on your phone to send it to someone later. Share icon is for when you want to hide your message in a photo and immediately send the photo through other messaging apps to the desired person.
fa: برای ارسال دستی عکس رمزنگاری شده، این دو شرط باید رعایت شود: شرط اول: شما می‌دانید که عکس را به چه کسی می‌خواهید بفرستید و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید. شرط دوم: عکس ارسال شده را به صورت فایل برای دوست خود می‌فرستید. برای مثال اگر از تلگرام برای ارسال عکس استفاده می‌کنید، باید عکس را به صورت فایل بفرستید و نه از روی گالری گوشی، زیرا تلگرام حجم عکس‌ها را کم می‌کند و چنین عکسی را نمی‌شود رمزگشایی کرد. اما اگر عکس را به شکل فایل ارسال کنید تلگرام هیچ تغییری روی عکس اعمال نمی‌کند و این عکس را می‌وسد رمزگشایی کرد. با فرض رعایت دو شرط بالا، در نهفت به صفحه چت شخصی که پیامش را میخواهید برایش پیام رمزنگاری شده بفرستید، بروید. سمت چپ پایین صفحه روی آیکن دوربین کلیک کنید. پس از کلیک، دو آیکن جدید پدیدار می‌شوند. آیکن شکل دانلود برای وقتی هست که می‌خواهید پیام خود را در یک عکس پنهان کرده و عکس را در گوشی خود ذخیره کنید تا سر فرصت آن را برای کسی که می‌خواهید ارسال کنید. آیکن شکل اشتراک‌گذاری برای وقتی هست که می‌خواهید پیام خود را در یک عکس پنهان کرده و بلافاصله عکس را از طریق پیام‌رسان‌های دیگر به شخص مورد نظر بفرستید.

source: To send an encrypted photo manually, you need to follow these two conditions: Condition 1: You know who you want to send the photo to and have previously exchanged public keys…
fa: برای ارسال دستی عکس رمزنگاری شده، این دو شرط باید رعایت شود: شرط اول: شما می‌دانید که عکس را به چه کسی می‌خواهید بفرستید و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید.…

source: To view your friend's public key, go to the chat page of you and your friend. On the chat page, click on their name, a new page will open where you can see both your friend's public key and your own public key. Your public key can also be viewed from the settings section.
fa: برای دیدن کلید عمومی دوستتان به صفحه چت با او در نهفت بروید. در صفحه‌ی چت روی نام دوست خود کلیک کنید. یک صفحه باز می‌شود در این صفحه شما می‌توانید کلید عمومی دوستتان و کلید عمومی خودتان را ببینید. کلید عمومی شما از بخش تنظیمات نهفت هم قابل مشاهده است.

source: Type Your Message
fa: پیام خود را وارد کنید

source: Verified status
fa: وضعیت تایید شده

source: You
fa: شما

source: You have denied access. Please go to the settings app and locate Nahoft and turn Face ID on.
fa: شما دسترسی را محدود کردید. لطفا به تنظیمات نرم افزار بروید به نهفت را پیدا کنید و دسترسی Face ID را فعال کنید

source: You have not registered any Face IDs yet.
fa: شما هنوز Face ID را در دستگاه خود فعال نکردید

source: You have not registered any fingerprint yet.
fa: شما هیچ اثر انگشتی در دستگاه خود ثبت نکردید

source: You have sent your public key to %@ and are now awaiting their public key in return.
fa: شما کلید عمومی خود را به "نام کاربر" ارسال کرده اید و اکنون منتظر کلید عمومی آنها هستید. پس از دریافت کلید عمومی "نام کاربر"، یک اتصال امن برقرار می‌شود. برای وارد کردن دستی کلید عمومی %@ از دکمه‌ی زیر استفاده کنید.

source: Your Code
fa: کد شما

source: Your Face ID or fingerprint were not recognized
fa: چهره و یا اثر انگشت شما شناسایی نشد

source: Your friend's public key
fa: کلید عمومی دوست شما

source: Your passcode is incorrect
fa: رمز ورود اشتباه است

source: Your public key
fa: کلید عمومی شما
