Repository: u4i-admin/Nahoft-iOS
Catalog: Nahoft/*.lproj/Localizable.strings
Languages: fa

source: "Nahoft" is one of the apps that has been created in the Iran Cubator 2 program and under the supervision of the "United for Iran" organization. United for Iran is a human rights organization based in Berkeley, California. Its goal is to promote civil liberties in Iran, defend human rights, support civil society, and encourage citizens to participate through technology.
fa: «نهفت» از جمله تولیداتی است که در برنامه ایران کوباتور۲ و تحت نظارت سازمان «اتحاد برای ایران» تهیه شده است. سازمان اتحاد برای ایران یک نهاد حقوق‌بشری است که مرکز آن در شهر برکلی، ایالت کالیفرنیا قرار دارد. هدف این نهاد گسترش آزادی‌های مدنی در ایران، دفاع از حقوق بشر، حمایت از جامعه مدنی و ترغیب شهروندان به مشارکت از طریق فناوری است.

source: “Nahoft” is not a messaging app. It is a tool for encryption. Nahoft is an offline software for encrypting text messages on Android phones. Encrypting your text messages means that even if your message gets intercepted by a third party, that party can not read it. The only person that can read your message is the one with whom you exchanged your public key. Nahoft is offline, which means you do not need to be connected to the internet to encrypt your messages. Nahoft only encrypts text messages. Currently, it does not provide encrypted voice and video messages. Nahoft can encrypt text messages as text. It also can encrypt them as a photo (Steganography.) You can send an encrypted text message or a photo containing a message via another channel that allows you to send the file (for example, SMS, MMS, or a messaging app that allows you to send the file unchanged.) So, the other person, after receiving the message, transfers the encrypted text or photo to Nahoft and reads it. For the time being, Nahoft can be installed on phones that use the Android operating system. Nahoft is not a messaging app. It only encrypts the user’s text messages. The user can send the encrypted message to another one through one of the messaging apps (in an insecure network or even using an insecure messaging app.) The other person should be using Nahoft as well. Both should have already exchanged the public keys with one another to enter the messages into this software and read the encrypted messages. Nahoft uses public keys that can be shared with others. It also creates a private key hidden in the app to read the sent messages between two users. Nahoft’s goal is to make it possible for users to send secure messages even through insecure messaging apps and networks. It means that if a user does not have access to secure internet or can not use secure messaging apps (in the case of internet censorship, filtering, and total internet shutdown) and only have access to insecure messaging apps and networks inside the country, even in this case, the users can encrypt the text messages and send them in the network. So, even if the message gets intercepted, it will still not be intelligible since it is encrypted. Note: Public keys (also the private key) change whenever you delete and reinstall the app, as well as each time you change your phone and reinstall the app. So, each time you change your phone or delete the app and reinstall it, you need to exchange the keys with your friends. Important: Nahoft is open-source software, and everyone can have access to its code.
fa: نهفت یک پیام‌رسان نیست، بلکه ابزاری برای رمزنگاری است. «نهفت» نرم‌افزار آفلاین برای رمزنگاری پیام‌های متنی در گوشی‌های اندرویدی است. رمزنگاری کردن پیام متنی یعنی حتی اگر پیام ارسالی شما در میان راه توسط فرد سومی دیده شود، برای آن شخص سوم قابل خواندن نخواهد بود و تنها شخصی که شما کلید عمومی خود را با او رد و بدل کرده‌اید، می‌تواند پیام مورد نظر را بخواند. این نرم‌افزار، آفلاین است، یعنی برای تبدیل پیام‌های متنی به پیام‌های رمزگذاری شده، نیازی به اینترنت آنلاین ندارد و می‌تواند بصورت مستقل و بدون اینترنت جهانی، پیام‌های نوشتاری را رمزنگاری کند. «نهفت» تنها پیام‌های متنی را رمزنگاری می‌کند و در حال حاضر امکان رمزنگاری پیام‌های صوتی و تصویری در آن فراهم نیست. نهفت می‌تواند پیام‌های متنی را هم بصورت یک متن رمزنگاری کند و هم می‌تواند آن را در داخل یک عکس، که شما انتخاب می‌کنید، پنهان کند. شما می‌توانید پیام متنی یا عکس حاوی پیام را از طریق دیگری که امکان ارسال فایل را فراهم می‌کند (مثلا ایمیل، یا اس‌ام‌اس یا ام‌ام‌اس، یا یک پیام‌رسان که امکان ارسال فایل بدون تغییر را فراهم می‌کند) بفرستید تا طرف مقابل نیز پس از دریافت، متن یا عکس رمزنگاری شده را به نهفت منتقل کند و پیام را بخواند. «نهفت»، فعلا در سیستم عامل اندروید و در گوشی‌های موبایلی که از این سیستم عامل استفاده می‌کنند، قابل نصب است. نهفت یک پیام‌رسان نیست، بلکه تنها پیام‌های متنی کاربر را رمزنگاری می‌کند و کاربر می‌تواند پیام رمز‌نگاری شده را از طریق یکی از پیام رسان‌های خود (در شبکه‌ای ناامن و حتی با یک پیام‌رسان ناامن) به فرد دیگری ارسال کند که او نیز از نهفت استفاده می‌کند. آنها باید قبلا با هم کلیدهای عمومی خود را همرسان و جابجا کرده باشند تا پیام‌ها را بعد از دریافت وارد این نرم‌افزار کنند و متن نهایی را در آنجا بخوانند. نهفت از کلیدهای عمومی که قابل همرسانی با دیگران است، استفاده می‌کند و کلیدی خصوصی می‌سازد که در داخل نرم‌افزار پنهان شده و می‌تواند پیام‌های رد و بدل شده بین دو کاربر را بخواند. هدف «نهفت» این است که امکان ارسال پیام امن برای کاربران حتی در پیام‌رسان‌ها و شبکه‌های ناامن فراهم شود. به این معنی که اگر کاربری در شرایط خاص، دسترسی به شبکه امن اینترنت جهانی نداشت، و یا استفاده از پیام‌رسان‌های امن برای او امکان‌پذیر نبود (فرض کنید در شرایط سانسور، فیلترینگ و یا قطع کامل شبکه جهانی اینترنت) و تنها به پیام‌رسان‌های ناامن و یا شبکه‌های ناامن داخلی دسترسی داشت، حتی در اینصورت هم بتواند پیام خود را رمزنگاری کرده و در داخل این شبکه ارسال کند. در این صورت حتی اگر پیام او در میان راه توسط فرد سومی دیده شود، باز هم به علت آنکه رمزنگاری شده است، قابل خواندن نخواهد بود. توجه: با هر بار پاک کردن کامل نرم‌افزار نهفت و نصب دوباره آن و همچنین با هر بار تغییر گوشی شما و در نتیجه نصب دوباره نهفت، کلیدهای عمومی (و نیز کلید خصوصی) تغییر می‌کند. بنابراین هربار که گوشی شما تغییر می‌کند و یا نهفت را پاک کرده و دوباره نصب می‌کنید، باید دوباره با دوستان خود این کلیدها را جابجا کنید. مهم: نهفت یک نرم‌افزار متن باز (اوپن‌سورس) است و همه می‌توانند به کدهای برنامه‌نویسی آن دسترسی داشته باشند.

source: “Nahoft” is not a messaging app. It is a tool for encryption. Nahoft is an offline software for encrypting text messages on Android phones. Encrypting your text messages means that even if your message gets intercepted by a third party, that party can not read it. The only person that can read your message is the one with whom you exchanged your public key…
fa: نهفت یک پیام‌رسان نیست، بلکه ابزاری برای رمزنگاری است. «نهفت» نرم‌افزار آفلاین برای رمزنگاری پیام‌های متنی در گوشی‌های اندرویدی است. رمزنگاری کردن پیام متنی یعنی حتی اگر پیام ارسالی شما در میان راه توسط فرد سومی دیده شود، برای آن شخص سوم قابل خواندن نخواهد بود …

source: A security layer for sending messages over insecure channels Fully offline. Nahoft operates without servers Destruction code. Instantly erase your data.
fa: یک لایه امنیتی برای ارسال پیام‌ از طریق کانال‌های ناامن کاملاً آفلاین. نهفت بدون سرور عمل می‌کند. کد نابودی. بلافاصله داده‌هایتان را پاک کنید.

source: About Nahoft
fa: درباره نهفت

source: Add Friend
fa: افزودن دوست

source: Add new contact
fa: افزودن دوست جدید

source: Approve
fa: پذیرش

source: Approved status
fa: وضعیت پذیرش

source: By activating the 'Password' option, you can define a six-digit password that you will need every time you log in to Nahoft. By activating the password feature, at the bottom of the main screen, the 'Logout' option will be activated.
fa: با فعال کردن گزینه "رمز عبور" می‌توانید یک رمز شش رقمی تعریف کنید که برای هر بار ورود به نهفت به آن نیاز خواهید داشت. با فعال کردن ویژگی رمز عبور، در پایین صفحه اصلی نهفت گزینه "خروج" فعال می‌شود.

source: By enabling the 'Destruction code' option, you define a six-digit password that will be used to destroy all information stored inside the app, including deleting messages and friend lists. You will use this password in emergency situations so that the people you don’t want can’t have access to your information.
fa: با فعال کردن گزینه "رمز نابودی" شما یک رمز شش رقمی تعریف می‌کنید که برای نابودی همه اطلاعات ذخیره شده در داخل نهفت، از جمله پاک شدن پیام‌ها و لیست دوستان به کار خواهد آمد. شما از این رمز در مواقع اضطراری استفاده خواهید کرد تا اطلاعات شما احیانا در اختیار افرادی که صلاح نمی‌دانید، قرار نگیرد.

source: Close
fa: بستن

source: Copy
fa: کپی

source: Default status
fa: وضعیت پیش‌فرض

source: Delete a contact
fa: حذف دوست

source: Description
fa: توضیحات

source: Destruction Code
fa: کد نابودی

source: Edit contact name
fa: ویرایش نام دوست

source: Friend List
fa: لیست دوستان

source: Friend's public key
fa: کلید عمومی دوست شما

source: Get Started
fa: شروع کنید

source: Help
fa: کمک

source: How to manually receive encrypted text
fa: نحوه دریافت دستی متن رمزگذاری شده

source: How to manually send encrypted text
fa: نحوه ارسال دستی متن رمزگذاری شده

source: How to receive encrypted images
fa: نحوه دریافت دستی عکس رمزگذاری شده

source: How to send encrypted images
fa: نحوه ارسال دستی عکس رمزگذاری شده

source: Import
fa: وارد کردن

source: Import Message
fa: وارد کردن پیام

source: Importing to Nahoft through share option
fa: وارد کردن اطلاعات به نهفت از طریق گزینه‌ اشتراک گذاری

source: Invited status
fa: وضعیت دعوت شده

source: Iranian and non-Iranian experts with work experience in big tech companies came together and created Nahoft with the support of the United4Iran Organization.
fa: کارشناسان ایرانی و غیرایرانی با سابقه کار در شرکت‌های بزرگ فناوری، گرد هم آمدند و با حمایت سازمان اتحاد برای ایران نهفت را ایجاد کردند.

source: Just like other apps, Nahoft lets you share a text or photo from your gallery or mobile memory by selecting Nahoft from the list of suggested apps. Choosing Nahoft will take you to Nahoft's friend list, where you can select who you want to send a picture to.
fa: کاربر نهفت همچون دیگر نرم‌افزارهای موبایل، این امکان را داد که اگر بخواهد از داخل گالری یا حافظه‌ی موبایل خود متن یا عکسی را به اشتراک بگذارد، نهفت را از میان نرم‌افزارهای پیشنهادی انتخاب کند. با انتخاب نهفت، شما به بخش لیست دوستان در نهفت هدایت می‌شوید و می‌توانید دوست مورد نظر خود برای ارسال عکس یا متن را انتخاب کنید.

source: Keep your conversations private and secure with Nahoft, the end-to-end encrypted communication app.
fa: با رمزنگاری پیام‌هایتان توسط نهفت؛ مکالمات خود را خصوصی و ایمن نگه دارید.

source: Login
fa: ورود

source: Logout
fa: خروج

source: Me
fa: من

source: Message from your friend
fa: پیام از دوست شما

source: Nahoft creators
fa: سازندگان نهفت

source: Nahoft's features
fa: امکانات نهفت

source: Nahoft's team
fa: تیم نهفت

source: Nahoft's usage
fa: کاربرد نهفت

source: Name
fa: نام

source: New Friend
fa: دوست جدید

source: Nickname
fa: نام

source: No public key has been exchanged between you and %@ yet.
fa: هنوز هیچ کلید عمومی بین شما و %@ رد و بدل نشده است.

source: Ok
fa: تایید

source: Once you receive their public key, a secure connection will be stablished
fa: به محض دریافت کلید عمومی دوستتان، ارتباط امن بین شما برقرار خواهد شد.

source: Passcode
fa: رمز عبور

source: Please click the button bellow to submit your public key
fa: لطفا دکمه زیر لمس کنید تا کلید عمومی شما برای دوستتان ارسال شود.

source: Public Key
fa: کلید عمومی

source: read more
fa: بیشتر بخوانید

source: Reject
fa: رد

source: Requested status
fa: وضعیت در انتظار

source: Save
fa: ذخیره

source: Search...
fa: جستجو

source: Setting
fa: تنظیمات

source: Settings
fa: تنظیمات

source: Skip
fa: رد کردن

source: The option to log out will only be displayed if you have set a 'password.' By clicking on this option, you will immediately get logged out of Nahoft. If you don't use the logout option, Nahoft will lock itself after a few minutes of inactivity, and you will need your password to enter it.
fa: گزینه‌ی خروج تنها در صورتی نمایش داده می‌وشد که شما برای نهفت یک "رمز عبور" تعیین کرده باشید. با کلیک بر روی این گزینه بلافاصله از نهفت خارج می‌شوید. اگر شما از گزینه خروج استفاده نکنید، نهفت بعد از چند دقیقه عدم استفاده، خود بخود قفل می‌شود و شما برای ورود به آن نیازمند رمز خود خواهید بود.

source: This software utilizes the well-known library libsodium and the Asymmetric Encryption with Authentication method for encryption and decryption. Each user has a private key and a public key. When User 1 wants to send a message to User 2, they use their own private key and User 2's public key for encryption. The generated message has only two possible ways for decryption: . Using User 1's private key, who generated the message, and User 2's public key. . Using User 2's private key, who is the recipient of the message, and User 1's public key. Therefore, in order for your friends to send you a message, they must have your public key. If you expose your public key to the public, it will not pose any security issues. You can see your public key from the setting.
fa: نهفت چگونه کار می کند؟ این نرم‌افزار از کتابخانه معتبر libsodium استفاده می‌کند و از روش رمزگذاری و رمزگشایی با امضای دوطرفه (Asymmetric Encryption with Authentication) بهره می‌برد. هر کاربر دارای یک کلید خصوصی و یک کلید عمومی است. زمانی که کاربر ۱ می‌خواهد پیامی را به کاربر ۲ ارسال کند، از کلید خصوصی خود و کلید عمومی کاربر ۲ برای رمزگذاری استفاده می‌کند. پیام تولید شده فقط دو راه برای رمزگشایی دارد: استفاده از کلید خصوصی کاربر ۱ که پیام را تولید کرده است و کلید عمومی کاربر ۲. استفاده از کلید خصوصی کاربر ۲ که دریافت کننده پیام است و کلید عمومی کاربر ۱ بنابراین، دوستان شما برای ارسال پیام به شما باید کلید عمومی شما را داشته باشند. اگر شما کلید عمومی خود را در دسترس عموم قرار دهید، هیچ مشکل امنیتی ای وجود نخواهد داشت. شما می‌توانید کلید عمومی خودتان را از بخش تنظمیات مشاهده کنید.

source: This software utilizes the well-known library libsodium and the Asymmetric Encryption with Authentication method for encryption and decryption. Each user has a private key and a public key. When User 1 wants to send a message to User 2, they use their own private key and User 2's public key for encryption…
fa: نهفت چگونه کار می کند؟ این نرم‌افزار از کتابخانه معتبر libsodium استفاده می‌کند و از روش رمزگذاری و رمزگشایی با امضای دوطرفه (Asymmetric Encryption with Authentication) بهره می‌برد. هر کاربر دارای یک کلید خصوصی و یک کلید عمومی است. زمانی که کاربر ۱ می‌خواهد پیامی را به کاربر ۲ ارسال کند، از کلید خصوصی خود و کلید عمومی کاربر ۲ برای رمزگذاری استفاده می‌کند.…

source: This status is displayed with a blue circle next to your friend's name. It means the public key has been exchanged between you and your friend.
fa: این وضعیت با یک دایره آبی رنگ در کنار اسم دوست شما نمایش داده می‌شود. به این معنی است که کلید عمومی بین شما و دوستتان رد و بدل شده است.

source: This status is displayed with a gray circle next to your friend's name. And it means that you have added your friend to your friend list but you have not sent your public key to him/her yet, nor has he/she sent you his/her public key.
fa: این وضعیت با یک دایره خاکستری رنگ در کنار اسم دوست شما نمایش داده می‌شود. و به این معنی است که شما دوست خود را به لیست دوستتان اضافه کرده‌اید اما هنوز نه شما کلید عمومی‌تان را برای او فرستاده‌اید و نه او کلید عمومی خود را برای شما فرستاده است.

source: This status is displayed with a green and white confirmation icon next to your friend's name. It means that a public key exchange has occurred between you and your friend, and you have securely verified through a trusted third party that your friend has indeed sent their public key and not someone else.
fa: این وضعیت با یک آیکن تایید سبز و سفید رنگ کنار نام دوست شما نمایش داده می‌شود. این به این معنی است که یک تبادل کلید عمومی بین شما و دوستتان رخ داده است و شما از طریق یک روش سوم به صورت امن تأیید کرده‌اید که دوست شما واقعاً کلید عمومی خود را ارسال کرده است و نه فرد دیگری.

source: This status is displayed with a purple circle next to your friend's name. It means that you have sent your public key to your friend and are waiting to receive his public key.
fa: این وضعیت با یک دایره بنفش رنگ در کنار اسم دوست شما نمایش داده می‌شود. به این معنی است که شما کلید عمومی خود را برای دوستتان فرستاده‌اید و منتظر دریافت کلید عمومی او هستید.

source: This status is displayed with an orange circle next to your friend's name. It means that your friend has sent you his/her public key and is now requesting that you send him/her your public key.
fa: این وضعیت با یک دایره نارنجی رنگ در کنار اسم دوست شما نمایش داده می‌شود. به این معنی است که دوست شما کلید عمومی خود را برای شما ارسال کرده است و اکنون منتظر شما است تا کلید عمومی خود را برای او ارسال کنید.

source: Title
fa: عنوان

source: To add a new friend; Click on the plus + icon on home page. Two options will appear: Option 1: Add a new contact from the contact list. By selecting this option, you will be directed to the "contact list." If you have given Nahoft permission to access your phone's contacts, you can choose the contact you wish to add to your friends list from there. Option 2: Create a new contact. By choosing this option, a new window will open where you can enter your friend's name and phone number. Adding a phone number is optional, but if you plan to use the "Use SMS by default" feature, it's important to include the phone number. Otherwise, you'll need to manually send and receive messages to contacts without their phone numbers. For instructions on manual messaging, refer to the Chat Help section.
fa: برای افزودن یک دوست جدید؛ بر روی آیکن به علاوه + بزنید. دو گزینه پدیدار می‌شود: گزینه 1، افزودن مخاطب جدید از لیست مخاطبین. با انتخاب این گزینه، به “لیست مخاطبین” هدایت می‌شوید و اگر به نهفت اجازه دسترسی به دفترچه تلفن داده باشید، از آنجا می‌توانید مخاطب مورد نظر خود را برای افزودن به لیست دوستان انتخاب کنید. گزینه 2، ایجاد مخاطب جدید با انتخاب این گزینه، یک پنجره جدید باز می‌شود که می‌توانید نام و شماره تلفن دوست خود را وارد کنید. افزودن شماره تلفن اختیاری است اما اگر می‌خواهید از ویژگی “ استفاده از پیامک (SMS) به صورت پیش فرض” استفاده کنید باید شماره تلفن را نیز وارد کنید. در غیر این صورت، ارسال و دریافت پیام‌های مخاطبین بدون شماره تلفن باید به شکل دستی انجام شود. برای یادگیری ارسال و دریافت پیام به شکل دستی به بخش راهنمای چت بروید.

source: To add a new friend; Click on the plus + icon on home page. Two options will appear: Option 1: Add a new contact from the contact list. Option 2: Create a new contact.
fa: برای افزودن یک دوست جدید؛ بر روی آیکن به علاوه + بزنید. دو گزینه پدیدار می‌شود: گزینه 1، افزودن مخاطب جدید از لیست مخاطبین. گزینه 2، ایجاد مخاطب جدید

source: To decrypt and read an encrypted text, you need to follow these steps: 1. Make sure you know who sent the message and that you have previously exchanged public keys. 2. Copy the received encrypted text. 3. Go to the chat page of the person whose message you want to decrypt. 4. Click on the import file icon located at the top right of the page. A window will open. 5. Paste the text into the window and click the "Insert Text" option. 6. The decrypted message will be readable on the chat page.
fa: برای خواندن متن رمزنگاری شده، این شرط باید رعایت شود: شما می‌دانید که پیام را چه کسی ارسال کرده و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید. سپس پیام متنی رمزنگاری شده دریافت شده را کپی کرده و در نهفت به صفحه چت شخصی که پیامش را میخواهید رمزگشایی کنید بروید. سمت راست بالای صفحه روی آیکن سند یا داکیومنت کلیک کنید. یک پنجره باز می‌شود. متن را در آنجا بگذارید. و گزینه‌ی "وارد کردن متن" کلیک کنید. پیام رمگشایی شده در صفحه‌ی چت قابل خواندن است.

source: To decrypt and read an encrypted text, you need to follow these steps: 1. Make sure you know who sent the message and that you have previously exchanged public keys. 2. Copy the received encrypted text…
fa: برای خواندن متن رمزنگاری شده، این شرط باید رعایت شود: شما می‌دانید که پیام را چه کسی ارسال کرده و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید. سپس پیام متنی رمزنگاری شده دریافت شده را کپی کرده و در نهفت به صفحه چت شخصی که پیامش را میخواهید رمزگشایی کنید بروید.…

source: To delete a contact, follow these steps: Hold your finger on the name of the desired friend for a few seconds. After a few seconds, you will see a message asking if you are sure you want to delete your friend. By selecting the "Yes" option, your friend will be deleted.
fa: برای حذف یک مخاطب، مراحل زیر را دنبال کنید: انگشت خود را روی نام دوست مورد نظر چند ثانیه نگه دارید. پس از چند ثانیه، پیامی خواهید دید که از شما می‌پرسد آیا مطمئن هستید که می‌خواهید دوست خود را حذف کنید یا خیر. با انتخاب گزینه "بله" دوست شما حذف می‌شود.

source: To edit the name or phone number of your friend, follow these steps: Click once on the name of your friend to go to the chat page. Once inside the chat page, click again on the name of your friend. A new page will open where you can edit the name and phone number of your friend.
fa: برای ویرایش نام و یا شماره تلفن دوستتان این مراحل را دنبال کنید: با یک بار کلیک بر روی نام دوست خود به صفحه چت بروید. از داخل صفحه‌ی چت دوباره روی نام دوست خود کلیک کنید. یک صفحه باز می‌شود که در آنجا می‌توانید نام و شماره تلفن دوست خود را ویرایش کنید.

source: To manually decrypt an encrypted photo, you need to follow these two conditions: Condition 1: You know who sent the photo and have previously exchanged public keys. Condition 2: The sent photo has been sent to you as a file, and you have saved it as a file on your mobile device. If, for example, you receive a photo on Telegram that has been compressed by Telegram, it cannot be decrypted. Assuming you have met the above two conditions, go to the chat page of the person whose message you want to decrypt. On the top right side of the page, click on the image icon. A pop-up window will appear, allowing you to browse and select the desired photo from your mobile device. The decrypted message will be readable in the chat page.
fa: برای رمزگشایی دستی عکس رمزنگاری شده، این دو شرط باید رعایت شود: شرط اول: شما می‌دانید که عکس را چه کسی ارسال کرده و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید. شرط دوم: عکس ارسال شده به صورت فایل برای شما ارسال شده و شما آن را به صورت فایل در موبایل خود ذخیره کرده‌اید. اگر برای مثال در تلگرام عکسی دریافت کرده‌اید که توسط تلگرام حجم آن کاهش پیدا کرده، این عکس را نمی‌شود رمزگشایی کرد. با فرض رعایت دو شرط بالا، در نهفت به صفحه چت شخصی که پیامش را میخواهید رمزگشایی کنید بروید. سمت راست بالای صفحه روی آیکن عکس کلیک کنید. یک صفحه بالا می‌آید، از اینجا می‌توانید عکس مورد نظر را از روی موبایل پیدا کرده و روی نهفت بارگذاری کنید. پیام رمگشایی شده در صفحه‌ی چت قابل خواندن است.

source: To manually decrypt an encrypted photo, you need to follow these two conditions: Condition 1: You know who sent the photo and have previously exchanged public keys…
fa: برای رمزگشایی دستی عکس رمزنگاری شده، این دو شرط باید رعایت شود: شرط اول: شما می‌دانید که عکس را چه کسی ارسال کرده و قبلا کلیدهای عمومی خود را رد و بدل کرده‌اید.…

source: To manually send an encrypted text, you need to follow these steps: 1. Exchange public keys with your desired friend beforehand. 2. Go to your friend's chat page and, at the bottom of the page, write your message in the "type your message" section, similar to any other messaging platform. 3. Press the send button. Immediately after sending the message, a popup will appear. 4. Copy the encrypted text and send it to the intended person through any messaging platform you prefer.
fa: برای ارسال دستی متن رمزنگاری شده، این شرط باید رعایت شود: شما قبلا کلیدهای عمومی خود را با دوست مورد نظرتان رد و بدل کرده‌اید. به صفحه‌ی چت دوست مورد نظر خود بروید و در پایین صفحه در بخش "پیام خود را بنویس" مانند هر پیام رسان دیگری پیام را بنویسید و دکمه ارسال را بزنید. بلافاصله پس از ارسال پیام، یک صفحه بالا می‌آید، متن رمزنگاری شده را کپی کرده و از طریق هر پیام‌رسانی که صلاح می‌دانید برای شخص مورد نظر ارسال کنید.
